# TITANIC

In [1]:
import pandas as pd
import numpy as np
titanic = pd.read_csv('train.csv', index_col='PassengerId')
titanic.head()

,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
PassengerId,,,,,,,,,,,
1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [2]:
len(titanic)

891

In [5]:
titanic.isnull().sum()

Survived      0
Pclass        0
Name          0
Sex           0
Age         177
SibSp         0
Parch         0
Ticket        0
Fare          0
Cabin       687
Embarked      2
dtype: int64

In [6]:
titanic['Age'].mean()

29.69911764705882

In [7]:
titanic['Age'].median()

28.0

In [8]:
titanic['Age'].mode()

0    24.0
dtype: float64

In [9]:
titanic.Age.fillna(titanic.Age.median(), inplace=True)
titanic.head()

,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
PassengerId,,,,,,,,,,,
1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [63]:
titanic[titanic.Embarked.isnull()]

,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
PassengerId,,,,,,,,,,,
62,1,1,"Icard, Miss. Amelie",female,38.0,0,0,113572,80.0,B28,NaN
830,1,1,"Stone, Mrs. George Nelson (Martha Evelyn)",female,62.0,0,0,113572,80.0,B28,NaN

In [75]:
titanic[titanic['Name']=='Stone, Mrs. George Nelson (Martha Evelyn)']

,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
PassengerId,,,,,,,,,,,
830,1,1,"Stone, Mrs. George Nelson (Martha Evelyn)",female,62.0,0,0,113572,80.0,B28,S

In [64]:
titanic.loc[titanic.Embarked.isnull(), 'Embarked'] = titanic.Embarked.mode().values
titanic.head()

,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
PassengerId,,,,,,,,,,,
1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [18]:
titanic['Sex_Female'] = titanic.Sex.map({'male':0, 'female':1})
titanic.head()

,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Sex_Female
PassengerId,,,,,,,,,,,,
1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S,0
2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C,1
3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,1
4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S,1
5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S,0

In [19]:
embarked_dummies = pd.get_dummies(titanic.Embarked, prefix='Embarked')
titanic = pd.concat([titanic, embarked_dummies], axis=1)
titanic.head()

,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Sex_Female,Embarked_C,Embarked_Q,Embarked_S
PassengerId,,,,,,,,,,,,,,,
1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S,0,0,0,1
2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C,1,1,0,0
3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,1,0,0,1
4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S,1,0,0,1
5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S,0,0,0,1

In [20]:
a = []
b = []
c = []
for index in titanic.index:
    x = titanic.ix[index]['Name'].partition('.')
    a.append(x[0])
    b.append(x[1])
    c.append(x[2])

In [21]:
a1 = []
a2 = []
a3 = []
for index in range(len(a)):
    x = a[index].partition(',')
    a1.append(x[0])
    a2.append(x[1])
    a3.append(x[2])

In [22]:
c1 = []
c2 = []
c3 = []
for index in range(len(c)):
    x = c[index].partition('(')
    c1.append(x[0])
    c2.append(x[1])
    c3.append(x[2])

In [23]:
c4 = []
c5 = []
for index in range(len(c3)):
    x = c3[index].partition(')')
    c4.append(x[0])
    c5.append(x[1])

In [24]:
titanic['t1']=a1
titanic['t2']=a2
titanic['t3']=a3
titanic['t4']=b
titanic['t5']=c1
titanic['t6']=c2
titanic['t7']=c4
titanic['t8']=c5

In [25]:
titanic.head()

,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,...,Embarked_Q,Embarked_S,t1,t2,t3,t4,t5,t6,t7,t8
PassengerId,,,,,,,,,,,,,,,,,,,,,
1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,...,0,1,Braund,",",Mr,.,Owen Harris,,,
2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,...,0,0,Cumings,",",Mrs,.,John Bradley,(,Florence Briggs Thayer,)
3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,...,0,1,Heikkinen,",",Miss,.,Laina,,,
4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,...,0,1,Futrelle,",",Mrs,.,Jacques Heath,(,Lily May Peel,)
5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,...,0,1,Allen,",",Mr,.,William Henry,,,

In [26]:
len(titanic['t1'].unique())

667

In [27]:
len(titanic['t2'].unique())

1

In [28]:
len(titanic['t3'].unique())

17

In [29]:
len(titanic['t4'].unique())

1

In [30]:
len(titanic['t5'].unique())

773

In [31]:
len(titanic['t6'].unique())

2

In [32]:
len(titanic['t7'].unique())

144

In [33]:
len(titanic['t8'].unique())

2

In [34]:
titanic.groupby('t3', as_index = False, axis = 0)['Survived'].count().sort('Survived', ascending = False).head()

C:\ProgramData\Anaconda3\lib\site-packages\ipykernel\__main__.py:1: FutureWarning: sort(columns=....) is deprecated, use sort_values(by=.....)
  if __name__ == '__main__':

         t3  Survived
11       Mr       517
8      Miss       182
12      Mrs       125
7    Master        40
3        Dr         7

In [35]:
titanic.groupby('t6', as_index = False, axis = 0)['Survived'].count().sort('Survived', ascending = False).head()

C:\ProgramData\Anaconda3\lib\site-packages\ipykernel\__main__.py:1: FutureWarning: sort(columns=....) is deprecated, use sort_values(by=.....)
  if __name__ == '__main__':

  t6  Survived
0          748
1  (       143

In [36]:
# create a DataFrame of dummy variables for Embarked
name_dummies = pd.get_dummies(titanic.t3, prefix='Name')
name_dummies.drop(name_dummies.columns[0], axis=1, inplace=True)

# concatenate the original DataFrame and the dummy DataFrame
titanic = pd.concat([titanic, name_dummies], axis=1)

In [37]:
titanic['Parentesis'] = titanic['t6'].map({'(':1, '':0})

In [38]:
titanic.head()

,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,...,Name_ Miss,Name_ Mlle,Name_ Mme,Name_ Mr,Name_ Mrs,Name_ Ms,Name_ Rev,Name_ Sir,Name_ the Countess,Parentesis
PassengerId,,,,,,,,,,,,,,,,,,,,,
1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,...,0,0,0,1,0,0,0,0,0,0
2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,...,0,0,0,0,1,0,0,0,0,1
3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,...,1,0,0,0,0,0,0,0,0,0
4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,...,0,0,0,0,1,0,0,0,0,1
5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,...,0,0,0,1,0,0,0,0,0,0

In [39]:
titanic.groupby('Fare', as_index = False, axis = 0)['Survived'].count().sort('Survived',ascending = False).head()

C:\ProgramData\Anaconda3\lib\site-packages\ipykernel\__main__.py:1: FutureWarning: sort(columns=....) is deprecated, use sort_values(by=.....)
  if __name__ == '__main__':

        Fare  Survived
43    8.0500        43
85   13.0000        42
40    7.8958        38
30    7.7500        34
138  26.0000        31

In [40]:
titanic.columns

Index(['Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp', 'Parch', 'Ticket',
       'Fare', 'Cabin', 'Embarked', 'Sex_Female', 'Embarked_C', 'Embarked_Q',
       'Embarked_S', 't1', 't2', 't3', 't4', 't5', 't6', 't7', 't8',
       'Name_ Col', 'Name_ Don', 'Name_ Dr', 'Name_ Jonkheer', 'Name_ Lady',
       'Name_ Major', 'Name_ Master', 'Name_ Miss', 'Name_ Mlle', 'Name_ Mme',
       'Name_ Mr', 'Name_ Mrs', 'Name_ Ms', 'Name_ Rev', 'Name_ Sir',
       'Name_ the Countess', 'Parentesis'],
      dtype='object')

In [41]:
y = titanic['Survived']

In [44]:
features = ['Pclass', 'Age', 'Parch', 'Sex_Female', 'Embarked_Q', 'Embarked_S', 'Name_ Dr', 'Name_ Master', 'Name_ Miss',
            'Name_ Mr', 'Name_ Mrs', 'Name_ Ms', 'Name_ Rev', 'Parentesis', 'Parentesis']

In [45]:
X = titanic[features]
y = titanic.Survived

# train/test split
from sklearn.cross_validation import train_test_split
X_train, X_test, y_train, y_test = train_test_split(X, y, random_state=2)

# train a logistic regression model
from sklearn.linear_model import LogisticRegression
logreg = LogisticRegression(C=1e9)
logreg.fit(X_train, y_train)

# make predictions for testing set
y_pred_class = logreg.predict(X_test)

# calculate testing accuracy
from sklearn import metrics
print(metrics.accuracy_score(y_test, y_pred_class))

C:\ProgramData\Anaconda3\lib\site-packages\sklearn\cross_validation.py:44: DeprecationWarning: This module was deprecated in version 0.18 in favor of the model_selection module into which all the refactored classes and functions are moved. Also note that the interface of the new CV iterators are different from that of this module. This module will be removed in 0.20.
  "This module will be removed in 0.20.", DeprecationWarning)

0.80269058296

In [46]:
test_df = pd.read_csv('test.csv', header=0)

In [47]:
test_df.Age.fillna(test_df.Age.median(), inplace=True)
test_df['Sex_Female'] = (test_df['Sex'] == 'female').astype(np.int)
embarked_dummies = pd.get_dummies(test_df.Embarked, prefix='Embarked')
embarked_dummies.drop(embarked_dummies.columns[0], axis=1, inplace=True)
test_df = pd.concat([test_df, embarked_dummies], axis=1)

In [48]:
a = []
b = []
c = []
for index in test_df.index:
    x = test_df.ix[index]['Name'].partition('.')
    a.append(x[0])
    b.append(x[1])
    c.append(x[2])

In [49]:
a1 = []
a2 = []
a3 = []
for index in range(len(a)):
    x = a[index].partition(',')
    a1.append(x[0])
    a2.append(x[1])
    a3.append(x[2])

In [50]:
c1 = []
c2 = []
c3 = []
for index in range(len(c)):
    x = c[index].partition('(')
    c1.append(x[0])
    c2.append(x[1])
    c3.append(x[2])

In [51]:
c4 = []
c5 = []
for index in range(len(c3)):
    x = c3[index].partition(')')
    c4.append(x[0])
    c5.append(x[1])

In [52]:
test_df['t1']=a1
test_df['t2']=a2
test_df['t3']=a3
test_df['t4']=b
test_df['t5']=c1
test_df['t6']=c2
test_df['t7']=c4
test_df['t8']=c5

In [53]:
# create a DataFrame of dummy variables for Embarked
name_dummies = pd.get_dummies(test_df.t3, prefix='Name')
name_dummies.drop(name_dummies.columns[0], axis=1, inplace=True)

# concatenate the original DataFrame and the dummy DataFrame
test_df = pd.concat([test_df, name_dummies], axis=1)

In [54]:
test_df['Parentesis'] = test_df['t6'].map({'(':1, '':0})

In [55]:
predictions = logreg.predict(test_df[features])

In [ ]:
# Kaggle needs the submission to have a certain format;
# see https://www.kaggle.com/c/titanic-gettingStarted/download/gendermodel.csv
# for an example of what it's supposed to look like.
submission = pd.DataFrame({ 'PassengerId': test_df['PassengerId'],
                            'Survived': predictions })
submission.to_csv("titanic_submission.csv", index=False)